In [3]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [4]:
df = pd.read_csv("./Data/24,872 Flats _ Apartments for Sale in New Cairo _ dubizzle Egypt _OLX_.csv")

In [5]:
df.head()

,Title,Type,Price,Bedrooms,Bathrooms,Area,Verified
0,Apartment for sale in El lotus 1 minute to sod...,Apartment,"3,500,000.00",3,2,150,NaN
1,Apartment for sale immediate delivery super lux,Apartment,"5,600,000.00",3,2,160,NaN
2,Duplex for sale in south lotus immediate delivery,NaN,"6,500,000.00",4,4,280,NaN
3,"""Affordable Front-Facing 2nd Floor Apartment i...",Apartment,"2,200,000.00",2,2,130,NaN
4,Apartment for Sale Steps from 90th Street & Mi...,Apartment,"2,300,000.00",2,2,170,NaN

In [6]:
df["Verified"].value_counts()

Verified
Verified Business    4021
Verified User          51
Name: count, dtype: int64

In [7]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 7875 entries, 0 to 7874
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Title      7875 non-null   str
 1   Type       5910 non-null   str
 2   Price      7875 non-null   str
 3   Bedrooms   7875 non-null   int64
 4   Bathrooms  7875 non-null   int64
 5   Area       7875 non-null   int64
 6   Verified   4072 non-null   str
dtypes: int64(3), str(4)
memory usage: 430.8 KB

In [8]:
df.describe()

          Bedrooms    Bathrooms         Area
count  7875.000000  7875.000000  7875.000000
mean      2.823238     2.561270   176.691556
std       0.694690     0.796167    61.763511
min       1.000000     1.000000    38.000000
25%       2.000000     2.000000   140.000000
50%       3.000000     3.000000   166.000000
75%       3.000000     3.000000   200.000000
max       8.000000     7.000000   750.000000

In [9]:
df["Type"].value_counts()

Type
Apartment    5910
Name: count, dtype: int64

In [10]:
# Convert Price column to numeric
df['Price'] = df['Price'].str.replace(',', '').str.replace('$', '').astype(float)

In [11]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 7875 entries, 0 to 7874
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Title      7875 non-null   str
 1   Type       5910 non-null   str
 2   Price      7875 non-null   float64
 3   Bedrooms   7875 non-null   int64
 4   Bathrooms  7875 non-null   int64
 5   Area       7875 non-null   int64
 6   Verified   4072 non-null   str
dtypes: float64(1), int64(3), str(3)
memory usage: 430.8 KB

In [12]:
df.head()

,Title,Type,Price,Bedrooms,Bathrooms,Area,Verified
0,Apartment for sale in El lotus 1 minute to sod...,Apartment,3500000.0,3,2,150,NaN
1,Apartment for sale immediate delivery super lux,Apartment,5600000.0,3,2,160,NaN
2,Duplex for sale in south lotus immediate delivery,NaN,6500000.0,4,4,280,NaN
3,"""Affordable Front-Facing 2nd Floor Apartment i...",Apartment,2200000.0,2,2,130,NaN
4,Apartment for Sale Steps from 90th Street & Mi...,Apartment,2300000.0,2,2,170,NaN

In [13]:
df.drop(columns=["Verified"], inplace=True)

In [14]:
df.head()

,Title,Type,Price,Bedrooms,Bathrooms,Area
0,Apartment for sale in El lotus 1 minute to sod...,Apartment,3500000.0,3,2,150
1,Apartment for sale immediate delivery super lux,Apartment,5600000.0,3,2,160
2,Duplex for sale in south lotus immediate delivery,NaN,6500000.0,4,4,280
3,"""Affordable Front-Facing 2nd Floor Apartment i...",Apartment,2200000.0,2,2,130
4,Apartment for Sale Steps from 90th Street & Mi...,Apartment,2300000.0,2,2,170

In [18]:
df.to_csv("./Data/cleaned/cleaned_data1.xlsx", index=False)

In [24]:
df = pd.read_excel("./Data/24,872 Flats _ Apartments for Sale in New Cairo _ dubizzle Egypt _OLX_1.xlsx")

In [25]:
df.head()

,Title,Image,imagegalleryslide_URL,70cdfb32,6a4d360e,18b01e88,18b01e881,18b01e882,f7d5e47e,c72cec28,a649d57c,948d9e0a,Image3,c5d743c8
0,"Apartment for sale, fully finished, in Hyde Pa...",https://images.dubizzle.com.eg/thumbnails/1601...,https://www.dubizzle.com.eg/en/ad/apartment-fo...,"EGP 18,900,000",NaN,3,2,138 sqm,"Hyde Park New Cairo Compound, 5th Settlement•",4 days ago,Call,WhatsApp,NaN,NaN
1,"Two-bedroom apartment for sale in Hyde Park, N...",https://images.dubizzle.com.eg/thumbnails/1601...,https://www.dubizzle.com.eg/en/ad/two-bedroom-...,"EGP 14,990,000",NaN,3,2,120 sqm,"Hyde Park New Cairo Compound, 5th Settlement•",4 days ago,Call,WhatsApp,NaN,NaN
2,Duplex Ready to move for sale in Jayd Compound...,https://images.dubizzle.com.eg/thumbnails/1564...,https://www.dubizzle.com.eg/en/ad/duplex-ready...,"EGP 15,000,000","EGP 2,090,000 Down Payment",5,6,265 sqm,"Jayd Compound, 5th Settlement•",4 days ago,Call,WhatsApp,https://images.dubizzle.com.eg/thumbnails/8172...,Verified Business
3,Duplex 220m + 100m garden (immediate delivery)...,https://images.dubizzle.com.eg/thumbnails/1521...,https://www.dubizzle.com.eg/en/ad/duplex-220m-...,"EGP 11,245,000","EGP 1,730,000 Down Payment",4,3,220 sqm,"Rehab City, New Cairo•",4 days ago,Call,WhatsApp,https://images.dubizzle.com.eg/thumbnails/8172...,Verified Business
4,Apartment for sale snapshot in Katameya Garden...,https://images.dubizzle.com.eg/thumbnails/1642...,https://www.dubizzle.com.eg/en/ad/apartment-fo...,"EGP 2,300,000","EGP 1,800,000 Down Payment",2,1,110 sqm,"Katameya Gardens Compound, 5th Settlement•",4 days ago,Call,WhatsApp,NaN,NaN

In [27]:
df.drop(columns=["Image", "imagegalleryslide_URL", "6a4d360e", "c72cec28", "a649d57c", "948d9e0a", "Image3"], inplace=True)

In [28]:
df.head()

,Title,70cdfb32,18b01e88,18b01e881,18b01e882,f7d5e47e,c5d743c8
0,"Apartment for sale, fully finished, in Hyde Pa...","EGP 18,900,000",3,2,138 sqm,"Hyde Park New Cairo Compound, 5th Settlement•",NaN
1,"Two-bedroom apartment for sale in Hyde Park, N...","EGP 14,990,000",3,2,120 sqm,"Hyde Park New Cairo Compound, 5th Settlement•",NaN
2,Duplex Ready to move for sale in Jayd Compound...,"EGP 15,000,000",5,6,265 sqm,"Jayd Compound, 5th Settlement•",Verified Business
3,Duplex 220m + 100m garden (immediate delivery)...,"EGP 11,245,000",4,3,220 sqm,"Rehab City, New Cairo•",Verified Business
4,Apartment for sale snapshot in Katameya Garden...,"EGP 2,300,000",2,1,110 sqm,"Katameya Gardens Compound, 5th Settlement•",NaN

In [29]:
df.drop(columns=["f7d5e47e"], inplace=True)

In [30]:
df.head()

,Title,70cdfb32,18b01e88,18b01e881,18b01e882,c5d743c8
0,"Apartment for sale, fully finished, in Hyde Pa...","EGP 18,900,000",3,2,138 sqm,NaN
1,"Two-bedroom apartment for sale in Hyde Park, N...","EGP 14,990,000",3,2,120 sqm,NaN
2,Duplex Ready to move for sale in Jayd Compound...,"EGP 15,000,000",5,6,265 sqm,Verified Business
3,Duplex 220m + 100m garden (immediate delivery)...,"EGP 11,245,000",4,3,220 sqm,Verified Business
4,Apartment for sale snapshot in Katameya Garden...,"EGP 2,300,000",2,1,110 sqm,NaN

In [33]:
# Rename a few columns
df.rename(columns={
    "18b01e88": "Bedrooms",
    "18b01e881": "Bathrooms",
    "18b01e882": "Area",
    "c5d743c8": "Verified",
    "70cdfb32": "Price"
}, inplace=True)

In [34]:
df.head()

,Title,Price,Bedrooms,Bathrooms,Area,Verified
0,"Apartment for sale, fully finished, in Hyde Pa...","EGP 18,900,000",3,2,138 sqm,NaN
1,"Two-bedroom apartment for sale in Hyde Park, N...","EGP 14,990,000",3,2,120 sqm,NaN
2,Duplex Ready to move for sale in Jayd Compound...,"EGP 15,000,000",5,6,265 sqm,Verified Business
3,Duplex 220m + 100m garden (immediate delivery)...,"EGP 11,245,000",4,3,220 sqm,Verified Business
4,Apartment for sale snapshot in Katameya Garden...,"EGP 2,300,000",2,1,110 sqm,NaN

In [35]:
df.drop(columns=["Verified"], inplace=True)

In [36]:
df.head()

,Title,Price,Bedrooms,Bathrooms,Area
0,"Apartment for sale, fully finished, in Hyde Pa...","EGP 18,900,000",3,2,138 sqm
1,"Two-bedroom apartment for sale in Hyde Park, N...","EGP 14,990,000",3,2,120 sqm
2,Duplex Ready to move for sale in Jayd Compound...,"EGP 15,000,000",5,6,265 sqm
3,Duplex 220m + 100m garden (immediate delivery)...,"EGP 11,245,000",4,3,220 sqm
4,Apartment for sale snapshot in Katameya Garden...,"EGP 2,300,000",2,1,110 sqm

In [38]:
# Convert Area column into float64
df['Price'] = df['Price'].str.replace(',', '').str.replace('EGP', '').astype(float)

In [39]:
df.head()

,Title,Price,Bedrooms,Bathrooms,Area
0,"Apartment for sale, fully finished, in Hyde Pa...",18900000.0,3,2,138 sqm
1,"Two-bedroom apartment for sale in Hyde Park, N...",14990000.0,3,2,120 sqm
2,Duplex Ready to move for sale in Jayd Compound...,15000000.0,5,6,265 sqm
3,Duplex 220m + 100m garden (immediate delivery)...,11245000.0,4,3,220 sqm
4,Apartment for sale snapshot in Katameya Garden...,2300000.0,2,1,110 sqm

In [40]:
df['Area'] = df['Area'].str.replace(',', '').str.replace('sqm', '').astype(int)

In [41]:
df.head()

,Title,Price,Bedrooms,Bathrooms,Area
0,"Apartment for sale, fully finished, in Hyde Pa...",18900000.0,3,2,138
1,"Two-bedroom apartment for sale in Hyde Park, N...",14990000.0,3,2,120
2,Duplex Ready to move for sale in Jayd Compound...,15000000.0,5,6,265
3,Duplex 220m + 100m garden (immediate delivery)...,11245000.0,4,3,220
4,Apartment for sale snapshot in Katameya Garden...,2300000.0,2,1,110

In [42]:
df.to_excel("./Data/cleaned/cleaned_data2.xlsx")

In [45]:
df = pd.read_csv("./Data/cleaned/cleaned_data1.csv")

In [46]:
df.to_excel("./Data/cleaned/cleaned_data1.xlsx")

In [47]:
df = pd.read_csv("./Data/Apartments Prices Dataset version 2 .csv")

In [48]:
df.head()

,Price,Area,Rooms,Bathrooms,Floor Level,Year Built,Seller Type,View,Payment Method,Location,Amenities,Price_Numeric,Calculated_Price_Per_Meter
0,"2,163,000 EGP",120,2,3 bathroom,3.0,2025.0,Developer,Main Street,Installments,Second Neighborhood,Basic,2163000,18025.00
1,"3,250,000 EGP",162,3,2 bathroom,6.0,2024.0,Developer,Main Street,Cash or Installments,Jasmine Gardens Compound,Garden,3250000,20061.73
2,"2,650,000 EGP",122,3,1 bathroom,4.0,2024.0,Developer,Main Street,Cash or Installments,Sudan St,Finished,2650000,21721.31
3,"12,720,000 EGP",212,4,3 bathroom,13.0,2027.0,Broker,Club,Cash or Installments,Muruj,Super Lux,12720000,60000.00
4,"5,898,000 EGP",135,2,1 bathroom,6.0,2025.0,Developer,Lake,Cash or Installments,Unknown,Installment,5898000,43688.89

In [49]:
df.drop(columns=["Floor Level", "Year Built", "Seller Type", "View", "Payment Method", "Location", "Amenities", "Price_Numeric", "Calculated_Price_Per_Meter"], inplace=True)

In [50]:
df.head()

            Price  Area  Rooms   Bathrooms
0   2,163,000 EGP   120      2  3 bathroom
1   3,250,000 EGP   162      3  2 bathroom
2   2,650,000 EGP   122      3  1 bathroom
3  12,720,000 EGP   212      4  3 bathroom
4   5,898,000 EGP   135      2  1 bathroom

In [51]:
df['Price'] = df['Price'].str.replace(',', '').str.replace('EGP', '').astype(float)

In [52]:
df.head()

        Price  Area  Rooms   Bathrooms
0   2163000.0   120      2  3 bathroom
1   3250000.0   162      3  2 bathroom
2   2650000.0   122      3  1 bathroom
3  12720000.0   212      4  3 bathroom
4   5898000.0   135      2  1 bathroom

In [53]:
df["Bathrooms"] = df["Bathrooms"].str.replace(" bathroom", '')

In [54]:
df.head()

        Price  Area  Rooms Bathrooms
0   2163000.0   120      2         3
1   3250000.0   162      3         2
2   2650000.0   122      3         1
3  12720000.0   212      4         3
4   5898000.0   135      2         1

In [56]:
df.rename(columns={"Rooms": "Bedrooms"}, inplace=True)

In [57]:
df.head()

        Price  Area  Bedrooms Bathrooms
0   2163000.0   120         2         3
1   3250000.0   162         3         2
2   2650000.0   122         3         1
3  12720000.0   212         4         3
4   5898000.0   135         2         1

In [58]:
df["Title"] = ""

In [59]:
df.head()

        Price  Area  Bedrooms Bathrooms Title
0   2163000.0   120         2         3
1   3250000.0   162         3         2
2   2650000.0   122         3         1
3  12720000.0   212         4         3
4   5898000.0   135         2         1

In [60]:
df.to_excel("./Data/cleaned/cleaned_data3.xlsx")

In [61]:
df = pd.read_csv("./Data/Apartments Prices Dataset.csv")

In [62]:
df.head()

,price,area_sqm,rooms,bathrooms,floor_level,year_built,seller_type,view,price_per_sqm,payment_method,finishing_type
0,"2,163,000 EGP",120 m²,2 rooms,3 bathroom,3,2025,Developer,Main Street,"18,025 EGP/M²",Installments,Semi Finished
1,"3,250,000 EGP",162 m²,3 rooms,2 bathroom,6,2024,Developer,Main Street,"20,062 EGP/M²",Cash or Installments,Semi Finished
2,"2,650,000 EGP",122 m²,3 rooms,1 bathroom,4,2024,Developer,Main Street,"21,721 EGP/M²",Cash or Installments,Semi Finished
3,"12,720,000 EGP",212 m²,4 rooms,3 bathroom,13,2027,Broker,Club,"60,000 EGP/M²",Cash or Installments,Extra Super Lux
4,"5,898,000 EGP",135 m²,2 rooms,1 bathroom,6,2025,Developer,Lake,"43,689 EGP/M²",Cash or Installments,Super Lux

In [ ]:
df.drop(columns=["floor_level", "year_built", "seller_type", "view", "price_per_sqm", "payment_method", "finishing_type"], inplace=True)
df["Title"] = np.nan

df["area_sqm"] = df["area_sqm"].str.replace(" m²", "")
df["rooms"] = df["rooms"].str.replace(" rooms", "")
df["bathrooms"] = df["bathrooms"].str.replace(" bathroom", "")

df.rename(columns={
    "area_sqm": "Area",
    "rooms": "Bedrooms",
    "bathrooms": "Bathrooms",
}, inplace=True)

In [64]:
df.head()

            price Area Bedrooms Bathrooms  Title
0   2,163,000 EGP  120        2         3    NaN
1   3,250,000 EGP  162        3         2    NaN
2   2,650,000 EGP  122        3         1    NaN
3  12,720,000 EGP  212        4         3    NaN
4   5,898,000 EGP  135        2         1    NaN

In [66]:
df['price'] = df['price'].str.replace(',', '').str.replace('EGP', '').astype(float)

In [67]:
df.rename(columns={
    "price": "Price",
}, inplace=True)

In [68]:
df.head()

        Price Area Bedrooms Bathrooms  Title
0   2163000.0  120        2         3    NaN
1   3250000.0  162        3         2    NaN
2   2650000.0  122        3         1    NaN
3  12720000.0  212        4         3    NaN
4   5898000.0  135        2         1    NaN

In [69]:
df.to_excel("./Data/cleaned/cleaned_data4.xlsx")

In [70]:
df = pd.read_csv("./Data/combined.csv")

In [71]:
df.head()

,Type,Price,Bedrooms,Bathrooms,Area,Furnished,Level,Compound,Payment_Option,Delivery_Date,Delivery_Term,City
0,Apartment,"1,980,000.00",3,3,148,No,3,Nyoum,Cash or Installment,2024,Semi Finished,Asyut City
1,Apartment,"4,724,000.00",2,2,120,Unknown,3,Sun Capital,Cash or Installment,2025,Finished,6th of October
2,Apartment,"355,000.00",3,2,109,Unknown,2,Unknown,Unknown Payment,soon,Unknown,Zahraa Al Maadi
3,Apartment,"3,000,000.00",2,2,128,No,2,Bloomfields,Cash or Installment,soon,Not Finished,New Cairo - El Tagamoa
4,Apartment,"2,900,000.00",2,2,120,Unknown,1,Sun Capital,Installment,Ready to move,Unknown,6th of October

In [ ]:
df["City"].value_counts()

City
New Cairo - El Tagamoa    4601
6th of October            1092
Sheikh Zayed               911
Madinaty                   837
New Capital City           733
                          ...
Capital Heights 2            1
Al Yasmine                   1
Arabella Village             1
Tawny                        1
Beta Greens                  1
Name: count, Length: 273, dtype: int64

In [73]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 15311 entries, 0 to 15310
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Type            15311 non-null  str
 1    Price          15306 non-null  str
 2   Bedrooms        15310 non-null  str
 3   Bathrooms       15310 non-null  str
 4   Area            15300 non-null  str
 5   Furnished       15311 non-null  str
 6   Level           15311 non-null  str
 7   Compound        15311 non-null  str
 8   Payment_Option  15311 non-null  str
 9   Delivery_Date   15311 non-null  str
 10  Delivery_Term   15311 non-null  str
 11  City            12574 non-null  str
dtypes: str(12)
memory usage: 1.4 MB

In [78]:
df["Area"].value_counts()

Area
Unknown    2728
160         387
150         383
130         347
200         341
           ...
292           1
293           1
483           1
313           1
575           1
Name: count, Length: 369, dtype: int64

In [85]:
# Drop columns having Area as "Unknown"
df = df[df["Area"] != "Unknown"]

In [86]:
df["Area"].value_counts()

Area
160    387
150    383
130    347
200    341
165    333
      ...
292      1
293      1
483      1
313      1
575      1
Name: count, Length: 368, dtype: int64

In [90]:
df["Area"] = df["Area"].astype(float)

In [92]:
df.info()

<class 'pandas.DataFrame'>
Index: 12583 entries, 0 to 14198
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Type            12583 non-null  str
 1    Price          12578 non-null  str
 2   Bedrooms        12582 non-null  str
 3   Bathrooms       12582 non-null  str
 4   Area            12572 non-null  float64
 5   Furnished       12583 non-null  str
 6   Level           12583 non-null  str
 7   Compound        12583 non-null  str
 8   Payment_Option  12583 non-null  str
 9   Delivery_Date   12583 non-null  str
 10  Delivery_Term   12583 non-null  str
 11  City            12570 non-null  str
dtypes: float64(1), str(11)
memory usage: 1.2 MB

In [93]:
df.head()

,Type,Price,Bedrooms,Bathrooms,Area,Furnished,Level,Compound,Payment_Option,Delivery_Date,Delivery_Term,City
0,Apartment,"1,980,000.00",3,3,148.0,No,3,Nyoum,Cash or Installment,2024,Semi Finished,Asyut City
1,Apartment,"4,724,000.00",2,2,120.0,Unknown,3,Sun Capital,Cash or Installment,2025,Finished,6th of October
2,Apartment,"355,000.00",3,2,109.0,Unknown,2,Unknown,Unknown Payment,soon,Unknown,Zahraa Al Maadi
3,Apartment,"3,000,000.00",2,2,128.0,No,2,Bloomfields,Cash or Installment,soon,Not Finished,New Cairo - El Tagamoa
4,Apartment,"2,900,000.00",2,2,120.0,Unknown,1,Sun Capital,Installment,Ready to move,Unknown,6th of October

In [96]:
df.drop(columns=["Furnished", "Level", "Delivery_Term", "City", "Level", "Compound", "Payment_Option", "Delivery_Date"], inplace=True)

In [97]:
df.head()

        Type          Price  Bedrooms Bathrooms   Area
0  Apartment   1,980,000.00         3         3  148.0
1  Apartment   4,724,000.00         2         2  120.0
2  Apartment     355,000.00         3         2  109.0
3  Apartment   3,000,000.00         2         2  128.0
4  Apartment   2,900,000.00         2         2  120.0

In [99]:
# df[df["Area"] == ""]
df["Area"] = df["Area"].astype(float)

In [101]:
df.info()

<class 'pandas.DataFrame'>
Index: 12583 entries, 0 to 14198
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Type       12583 non-null  str
 1    Price     12578 non-null  str
 2   Bedrooms   12582 non-null  str
 3   Bathrooms  12582 non-null  str
 4   Area       12572 non-null  float64
dtypes: float64(1), str(4)
memory usage: 589.8 KB

In [102]:
df.columns

Index(['Type', ' Price ', 'Bedrooms', 'Bathrooms', 'Area'], dtype='str')

In [103]:
df.rename(columns={' Price ': "Price"}, inplace=True)

In [105]:
df["Price"] = df["Price"].str.strip()

In [107]:
df["Price"] = df["Price"].str.replace(",", "").astype(float)

In [108]:
df.head()

        Type      Price Bedrooms Bathrooms   Area
0  Apartment  1980000.0        3         3  148.0
1  Apartment  4724000.0        2         2  120.0
2  Apartment   355000.0        3         2  109.0
3  Apartment  3000000.0        2         2  128.0
4  Apartment  2900000.0        2         2  120.0

In [109]:
df["Title"] = "Unknown Title"

In [110]:
df.to_excel("./Data/cleaned/cleaned_data5.xlsx")

In [111]:
df = pd.read_csv("./Data/data.csv")

In [112]:
df.head()

,ad_id,type,price,area,bedrooms,bathrooms,level,furnished,rent,city,region
0,Ad id 194281336,apartment,3790000.0,207.0,3,3,2,NaN,no,giza,6th of october
1,Ad id 194198684,apartment,870000.0,155.0,3,3,4,no,no,cairo,new heliopolis
2,Ad id 191102186,apartment,1546400.0,170.0,3,2,9,NaN,no,cairo,zahraa al maadi
3,Ad id 193951860,apartment,1300000.0,270.0,4,3,ground,no,no,sharqia,10th of ramadan
4,Ad id 194064010,duplex,5888000.0,387.0,4,4,ground,no,no,cairo,new cairo - el tagamoa

In [113]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 54329 entries, 0 to 54328
Data columns (total 11 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ad_id      54329 non-null  str
 1   type       54329 non-null  str
 2   price      54329 non-null  float64
 3   area       54329 non-null  float64
 4   bedrooms   54329 non-null  str
 5   bathrooms  54329 non-null  str
 6   level      54329 non-null  str
 7   furnished  42448 non-null  str
 8   rent       54329 non-null  str
 9   city       54329 non-null  str
 10  region     54329 non-null  str
dtypes: float64(2), str(9)
memory usage: 4.6 MB

In [114]:
df[df["city"] == "cairo"]

,ad_id,type,price,area,bedrooms,bathrooms,level,furnished,rent,city,region
1,Ad id 194198684,apartment,870000.0,155.0,3,3,4,no,no,cairo,new heliopolis
2,Ad id 191102186,apartment,1546400.0,170.0,3,2,9,NaN,no,cairo,zahraa al maadi
4,Ad id 194064010,duplex,5888000.0,387.0,4,4,ground,no,no,cairo,new cairo - el tagamoa
5,Ad id 194021448,apartment,950000.0,104.0,2,1,7,no,no,cairo,nasr city
6,Ad id 194294715,apartment,2100000.0,160.0,3,2,1,no,no,cairo,mostakbal city
...,...,...,...,...,...,...,...,...,...,...,...
51280,Ad id 194282784,apartment,3200000.0,160.0,3,3,3,no,no,cairo,sheraton
51281,Ad id 194302223,apartment,2500000.0,143.0,3,1,6,no,no,cairo,madinaty
51283,Ad id 194376603,apartment,2000000.0,200.0,3,2,1,yes,no,cairo,new cairo - el tagamoa
51284,Ad id 194289105,apartment,1288300.0,76.0,1,1,4,no,no,cairo,new cairo - el tagamoa
51286,Ad id 193909805,apartment,7700000.0,226.0,3,3,2,no,no,cairo,mokattam

In [115]:
df = df[df["city"] == "cairo"]

In [116]:
df.head()

,ad_id,type,price,area,bedrooms,bathrooms,level,furnished,rent,city,region
1,Ad id 194198684,apartment,870000.0,155.0,3,3,4,no,no,cairo,new heliopolis
2,Ad id 191102186,apartment,1546400.0,170.0,3,2,9,NaN,no,cairo,zahraa al maadi
4,Ad id 194064010,duplex,5888000.0,387.0,4,4,ground,no,no,cairo,new cairo - el tagamoa
5,Ad id 194021448,apartment,950000.0,104.0,2,1,7,no,no,cairo,nasr city
6,Ad id 194294715,apartment,2100000.0,160.0,3,2,1,no,no,cairo,mostakbal city

In [117]:
df.drop(columns=["ad_id", "city", "region", "level", "furnished", "rent"], inplace=True)

In [118]:
df.rename(columns={
    "type": "Type",
    "area": "Area",
    "price": "Price",
    "bedrooms": "Bedrooms",
    "bathrooms": "Bathrooms"
}, inplace=True)

In [119]:
df.head()

        Type      Price   Area Bedrooms Bathrooms
1  apartment   870000.0  155.0        3         3
2  apartment  1546400.0  170.0        3         2
4     duplex  5888000.0  387.0        4         4
5  apartment   950000.0  104.0        2         1
6  apartment  2100000.0  160.0        3         2

In [120]:
df["Title"] = "Unknow"

In [121]:
df.to_excel("./Data/cleaned/cleaned_data6.xlsx")

In [122]:
df = pd.read_csv("./Data/Egypt_Houses_Price.csv")

In [123]:
df.head()

,Type,Price,Bedrooms,Bathrooms,Area,Furnished,Level,Compound,Payment_Option,Delivery_Date,Delivery_Term,City
0,Duplex,"4,000,000.00",3,3,400,No,7,Unknown,Cash,Ready to move,Finished,Nasr City
1,Apartment,"4,000,000.00",3,3,160,No,10+,Unknown,Cash,Ready to move,Finished,Camp Caesar
2,Apartment,"2,250,000.00",3,2,165,No,1,Unknown,Cash,Ready to move,Finished,Smoha
3,Apartment,"1,900,000.00",3,2,230,No,10,Unknown,Cash,Ready to move,Finished,Nasr City
4,Apartment,"5,800,000.00",2,3,160,No,Ground,Eastown,Cash,Ready to move,Semi Finished,New Cairo - El Tagamoa

In [124]:
df.drop(columns=["Furnished", "Level", "Delivery_Date", "Delivery_Term"], inplace=True)

In [125]:
df.head()

,Type,Price,Bedrooms,Bathrooms,Area,Compound,Payment_Option,City
0,Duplex,"4,000,000.00",3,3,400,Unknown,Cash,Nasr City
1,Apartment,"4,000,000.00",3,3,160,Unknown,Cash,Camp Caesar
2,Apartment,"2,250,000.00",3,2,165,Unknown,Cash,Smoha
3,Apartment,"1,900,000.00",3,2,230,Unknown,Cash,Nasr City
4,Apartment,"5,800,000.00",2,3,160,Eastown,Cash,New Cairo - El Tagamoa

In [126]:
df.drop(columns=["Compound"], inplace=True)

In [127]:
df.head()

,Type,Price,Bedrooms,Bathrooms,Area,Payment_Option,City
0,Duplex,"4,000,000.00",3,3,400,Cash,Nasr City
1,Apartment,"4,000,000.00",3,3,160,Cash,Camp Caesar
2,Apartment,"2,250,000.00",3,2,165,Cash,Smoha
3,Apartment,"1,900,000.00",3,2,230,Cash,Nasr City
4,Apartment,"5,800,000.00",2,3,160,Cash,New Cairo - El Tagamoa

In [128]:
df["City"].value_counts()

City
New Cairo - El Tagamoa    6789
North Coast               6362
Sheikh Zayed              2404
6th of October            1759
Ain Sukhna                1710
                          ...
Ataba                        1
Qanater al-Khairia           1
Bella                        1
Kafr Shukr                   1
Abu Rawash                   1
Name: count, Length: 183, dtype: int64

In [131]:
df[df["City"].str.startswith("New Cairo")]["City"].value_counts()

City
New Cairo - El Tagamoa    6789
Name: count, dtype: int64

In [136]:
df[df["City"].str.startswith("New Capital") | df["City"].str.startswith("New Cairo")]

,Type,Price,Bedrooms,Bathrooms,Area,Payment_Option,City
4,Apartment,"5,800,000.00",2,3,160,Cash,New Cairo - El Tagamoa
5,Apartment,"1,844,900.00",4,3,222,Cash or Installment,New Cairo - El Tagamoa
6,Duplex,"3,900,000.00",5,5,290,Unknown Payment,New Cairo - El Tagamoa
8,Apartment,"1,560,000.00",3,3,200,Unknown Payment,New Cairo - El Tagamoa
9,Apartment,"992,800.00",3,2,146,Cash or Installment,New Cairo - El Tagamoa
...,...,...,...,...,...,...,...
27353,Stand Alone Villa,"16,500,000.00",4,4,620,Cash,New Cairo - El Tagamoa
27354,Stand Alone Villa,"16,000,000.00",5,5,530,Cash,New Cairo - El Tagamoa
27355,Stand Alone Villa,"4,800,000.00",4,3,165,Cash or Installment,New Cairo - El Tagamoa
27357,Town House,"4,000,000.00",4,3,218,Cash or Installment,New Cairo - El Tagamoa
27358,Twin House,"13,800,000.00",3,4,308,Cash,New Cairo - El Tagamoa

In [137]:
df = df[df["City"].str.startswith("New Capital") | df["City"].str.startswith("New Cairo")]

In [138]:
df.head()

,Type,Price,Bedrooms,Bathrooms,Area,Payment_Option,City
4,Apartment,"5,800,000.00",2,3,160,Cash,New Cairo - El Tagamoa
5,Apartment,"1,844,900.00",4,3,222,Cash or Installment,New Cairo - El Tagamoa
6,Duplex,"3,900,000.00",5,5,290,Unknown Payment,New Cairo - El Tagamoa
8,Apartment,"1,560,000.00",3,3,200,Unknown Payment,New Cairo - El Tagamoa
9,Apartment,"992,800.00",3,2,146,Cash or Installment,New Cairo - El Tagamoa

In [139]:
df.drop(columns=["Payment_Option", "City"], inplace=True)

In [140]:
df.info()

<class 'pandas.DataFrame'>
Index: 7662 entries, 4 to 27358
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Type       7662 non-null   str
 1   Price      7662 non-null   str
 2   Bedrooms   7560 non-null   str
 3   Bathrooms  7565 non-null   str
 4   Area       7469 non-null   str
dtypes: str(5)
memory usage: 359.2 KB

In [142]:
df["Area"] = df["Area"].astype(float)

In [144]:
df["Area"] = df["Area"].astype(float).round()

In [145]:
df.Area

4        160.0
5        222.0
6        290.0
8        200.0
9        146.0
         ...
27353    620.0
27354    530.0
27355    165.0
27357    218.0
27358    308.0
Name: Area, Length: 7662, dtype: float64

In [ ]:
df["Price"] = df["Price"].str.strip().str.replace(",", "").astype(float)

In [150]:
df.info()

<class 'pandas.DataFrame'>
Index: 7662 entries, 4 to 27358
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Type       7662 non-null   str
 1   Price      7662 non-null   float64
 2   Bedrooms   7560 non-null   str
 3   Bathrooms  7565 non-null   str
 4   Area       7469 non-null   float64
dtypes: float64(2), str(3)
memory usage: 359.2 KB

In [151]:
df["Price"]

4         5800000.0
5         1844900.0
6         3900000.0
8         1560000.0
9          992800.0
            ...
27353    16500000.0
27354    16000000.0
27355     4800000.0
27357     4000000.0
27358    13800000.0
Name: Price, Length: 7662, dtype: float64

In [152]:
df.head()

        Type      Price Bedrooms Bathrooms   Area
4  Apartment  5800000.0        2         3  160.0
5  Apartment  1844900.0        4         3  222.0
6     Duplex  3900000.0        5         5  290.0
8  Apartment  1560000.0        3         3  200.0
9  Apartment   992800.0        3         2  146.0

In [153]:
df["Title"] = "Unknown Title"

In [154]:
df.to_excel("./Data/cleaned/cleaned_data7.xlsx")

In [156]:
df = pd.read_csv("./Data/properties.csv")

In [165]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 11418 entries, 0 to 11417
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Title      11418 non-null  str
 1   Type       11418 non-null  str
 2   Bedrooms   11418 non-null  str
 3   Bathrooms  11418 non-null  int64
 4   Area       11418 non-null  str
 5   Price      11418 non-null  str
dtypes: int64(1), str(5)
memory usage: 535.3 KB

In [157]:
df.head()

,title,type,location,bedroom,bathroom,size_sqm,price
0,Prime Location Duplex Fully Finished With A\C,Duplex,"Park View, North Investors Area, New Cairo Cit...",4,4,345,"6,850,000"
1,Town house resale at Mivida Emaar with best price,Villa,"Mivida, 5th Settlement Compounds, The 5th Sett...",3,3,285,"10,000,000"
2,Lake View Residence - Apartment | Prime Location,Apartment,"Lake View Residence, 5th Settlement Compounds,...",3,3,210,"5,700,000"
3,Best Penthouse for sale in villette ( sky conds ),Townhouse,"La Vista City, New Capital Compounds, New Capi...",4,4,230,"7,510,000"
4,2nd Floor | Fully Finished | Lowest Price |Par...,Penthouse,"Villette, 5th Settlement Compounds, The 5th Se...",5,6,284,"8,511,300"

In [158]:
df.drop(columns=["location"], inplace=True)

In [160]:
df.rename(columns={
    "title": "Title",
    "type": "Type",
    "bedroom": "Bedrooms",
    "bathroom": "Bathrooms",
    "size_sqm": "Area",
    "price": "Price"
}, inplace=True)

In [161]:
df.head()

,Title,Type,Bedrooms,Bathrooms,Area,Price
0,Prime Location Duplex Fully Finished With A\C,Duplex,4,4,345,"6,850,000"
1,Town house resale at Mivida Emaar with best price,Villa,3,3,285,"10,000,000"
2,Lake View Residence - Apartment | Prime Location,Apartment,3,3,210,"5,700,000"
3,Best Penthouse for sale in villette ( sky conds ),Townhouse,4,4,230,"7,510,000"
4,2nd Floor | Fully Finished | Lowest Price |Par...,Penthouse,5,6,284,"8,511,300"

In [163]:
df["Price"].value_counts()

Price
Ask            412
2,500,000      174
3,000,000      168
3,500,000      154
4,000,000      131
              ...
1,164,500        1
100,000,000      1
1,837,500        1
10,276,891       1
4,554,066        1
Name: count, Length: 2497, dtype: int64

In [166]:
df[df["Price"] != "Ask"]

,Title,Type,Bedrooms,Bathrooms,Area,Price
0,Prime Location Duplex Fully Finished With A\C,Duplex,4,4,345,"6,850,000"
1,Town house resale at Mivida Emaar with best price,Villa,3,3,285,"10,000,000"
2,Lake View Residence - Apartment | Prime Location,Apartment,3,3,210,"5,700,000"
3,Best Penthouse for sale in villette ( sky conds ),Townhouse,4,4,230,"7,510,000"
4,2nd Floor | Fully Finished | Lowest Price |Par...,Penthouse,5,6,284,"8,511,300"
...,...,...,...,...,...,...
11413,فيلا تشطيب الترا سوبر لوكس بالتجمع علي شارع رئ...,Villa,8,7,"1,500","30,000,000"
11414,town house for sale 220m Mountain View III,Townhouse,4,4,220,"10,276,891"
11415,3 Bedrooms|Del 2026|5% Down|9 years install,Apartment,3,3,177,"2,811,346"
11416,Very prime location penthouse 275m for sale,Penthouse,5,4,275,"3,000,000"
11417,Buy your unit with installments over 9 years M...,Penthouse,3,3,160,"4,554,066"

In [167]:
df = df[df["Price"] != "Ask"]

In [168]:
df["Price"] = df["Price"].str.strip().str.replace(",", "").astype(float)

In [169]:
df.info()

<class 'pandas.DataFrame'>
Index: 11006 entries, 0 to 11417
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Title      11006 non-null  str
 1   Type       11006 non-null  str
 2   Bedrooms   11006 non-null  str
 3   Bathrooms  11006 non-null  int64
 4   Area       11006 non-null  str
 5   Price      11006 non-null  float64
dtypes: float64(1), int64(1), str(4)
memory usage: 601.9 KB

In [170]:
df.head()

,Title,Type,Bedrooms,Bathrooms,Area,Price
0,Prime Location Duplex Fully Finished With A\C,Duplex,4,4,345,6850000.0
1,Town house resale at Mivida Emaar with best price,Villa,3,3,285,10000000.0
2,Lake View Residence - Apartment | Prime Location,Apartment,3,3,210,5700000.0
3,Best Penthouse for sale in villette ( sky conds ),Townhouse,4,4,230,7510000.0
4,2nd Floor | Fully Finished | Lowest Price |Par...,Penthouse,5,6,284,8511300.0

In [172]:
df["Area"] = df["Area"].str.replace(",", "").astype(float)

In [173]:
df.head()

,Title,Type,Bedrooms,Bathrooms,Area,Price
0,Prime Location Duplex Fully Finished With A\C,Duplex,4,4,345.0,6850000.0
1,Town house resale at Mivida Emaar with best price,Villa,3,3,285.0,10000000.0
2,Lake View Residence - Apartment | Prime Location,Apartment,3,3,210.0,5700000.0
3,Best Penthouse for sale in villette ( sky conds ),Townhouse,4,4,230.0,7510000.0
4,2nd Floor | Fully Finished | Lowest Price |Par...,Penthouse,5,6,284.0,8511300.0

In [174]:
df.to_excel("./Data/cleaned/cleaned_data8.xlsx")

In [196]:
df = pd.read_excel("./Data/Real Estate.xlsx")

In [197]:
df.head()

,description,price,location,type,size,bedrooms,bathrooms,payment_method
0,OWN A CHALET IN EL GOUNA WITH A PRIME LOCATION...,8000000.0,"Swan Lake Gouna, Al Gouna, Hurghada, Red Sea",Chalet,732 sqft / 68 sqm,1,1.0,Cash
1,"For sale, a villa with immediate delivery in C...",25000000.0,"Karmell, New Zayed City, Sheikh Zayed City, Giza",Villa,"2,368 sqft / 220 sqm",4,4.0,Cash
2,"With a down payment of EGP 1,513,000, a fully ...",15135000.0,"Azha North, Ras Al Hekma, North Coast",Chalet,"1,270 sqft / 118 sqm",2,2.0,Cash
3,Own an apartment in New Cairo with a minimal d...,12652000.0,"Taj City, 5th Settlement Compounds, The 5th Se...",Apartment,"1,787 sqft / 166 sqm",3,2.0,Installments
4,Project: Granville\nLocation: Fifth Settlement...,45250000.0,"Granville, New Capital City, Cairo",Villa,"4,306 sqft / 400 sqm",7,7.0,Cash

In [198]:
df.drop(columns=["description", "location", "payment_method"], inplace=True)

In [199]:
df.head()

        price       type                  size bedrooms  bathrooms
0   8000000.0     Chalet     732 sqft / 68 sqm        1        1.0
1  25000000.0      Villa  2,368 sqft / 220 sqm        4        4.0
2  15135000.0     Chalet  1,270 sqft / 118 sqm        2        2.0
3  12652000.0  Apartment  1,787 sqft / 166 sqm        3        2.0
4  45250000.0      Villa  4,306 sqft / 400 sqm        7        7.0

In [200]:
df.rename(columns={
    "price": "Price",
    "type": "Type",
    "size": "Area",
    "bedrooms": "Bedrooms",
    "bathrooms": "Bathrooms"
}, inplace=True)

In [201]:
df.head()

        Price       Type                  Area Bedrooms  Bathrooms
0   8000000.0     Chalet     732 sqft / 68 sqm        1        1.0
1  25000000.0      Villa  2,368 sqft / 220 sqm        4        4.0
2  15135000.0     Chalet  1,270 sqft / 118 sqm        2        2.0
3  12652000.0  Apartment  1,787 sqft / 166 sqm        3        2.0
4  45250000.0      Villa  4,306 sqft / 400 sqm        7        7.0

In [202]:
df["Title"] = np.nan

In [203]:
df.head()

        Price       Type                  Area Bedrooms  Bathrooms  Title
0   8000000.0     Chalet     732 sqft / 68 sqm        1        1.0    NaN
1  25000000.0      Villa  2,368 sqft / 220 sqm        4        4.0    NaN
2  15135000.0     Chalet  1,270 sqft / 118 sqm        2        2.0    NaN
3  12652000.0  Apartment  1,787 sqft / 166 sqm        3        2.0    NaN
4  45250000.0      Villa  4,306 sqft / 400 sqm        7        7.0    NaN

In [204]:
df["Bedrooms"].value_counts()

Bedrooms
3    8696
2    4597
4    3252
1    1198
5    1111
6     347
s     328
7     251
Name: count, dtype: int64

In [206]:
df = df[df["Bedrooms"] != "s"]

In [207]:
df["Bedrooms"] = df["Bedrooms"].astype(int)

In [208]:
df.head()

        Price       Type                  Area  Bedrooms  Bathrooms  Title
0   8000000.0     Chalet     732 sqft / 68 sqm         1        1.0    NaN
1  25000000.0      Villa  2,368 sqft / 220 sqm         4        4.0    NaN
2  15135000.0     Chalet  1,270 sqft / 118 sqm         2        2.0    NaN
3  12652000.0  Apartment  1,787 sqft / 166 sqm         3        2.0    NaN
4  45250000.0      Villa  4,306 sqft / 400 sqm         7        7.0    NaN

In [211]:
df["Bedrooms"] = df["Bedrooms"].astype(float)

In [212]:
df.head()

        Price       Type                  Area  Bedrooms  Bathrooms  Title
0   8000000.0     Chalet     732 sqft / 68 sqm       1.0        1.0    NaN
1  25000000.0      Villa  2,368 sqft / 220 sqm       4.0        4.0    NaN
2  15135000.0     Chalet  1,270 sqft / 118 sqm       2.0        2.0    NaN
3  12652000.0  Apartment  1,787 sqft / 166 sqm       3.0        2.0    NaN
4  45250000.0      Villa  4,306 sqft / 400 sqm       7.0        7.0    NaN

In [214]:
df["Area"] = (
    df["Area"]
    .str.extract(r'(\d+(?:\.\d+)?)\s*sqm', expand=False)
    .astype(float)
)

In [215]:
df.head()

        Price       Type   Area  Bedrooms  Bathrooms  Title
0   8000000.0     Chalet   68.0       1.0        1.0    NaN
1  25000000.0      Villa  220.0       4.0        4.0    NaN
2  15135000.0     Chalet  118.0       2.0        2.0    NaN
3  12652000.0  Apartment  166.0       3.0        2.0    NaN
4  45250000.0      Villa  400.0       7.0        7.0    NaN

In [216]:
df["Area"] = df["Area"].astype(int)

In [217]:
df.head()

        Price       Type  Area  Bedrooms  Bathrooms  Title
0   8000000.0     Chalet    68       1.0        1.0    NaN
1  25000000.0      Villa   220       4.0        4.0    NaN
2  15135000.0     Chalet   118       2.0        2.0    NaN
3  12652000.0  Apartment   166       3.0        2.0    NaN
4  45250000.0      Villa   400       7.0        7.0    NaN

In [218]:
df.to_excel("./Data/cleaned/cleaned_data9.xlsx")